# 범위 슬라이싱 

- df.iloc[시작인덱스:종료인덱스:증감값]
- df.loc[시작인덱스 종료인덱스 증감값]

In [1]:
import pandas as pd

In [4]:
raw_data = {"이름" : ["이상해씨", "파이리", "꼬부기", "캐터피"],
            "타입" : ["풀", "불", "물", "벌레"],
            "체력" : [45, 39, 44, 45],
            "도감등록" : ["yes", "no", "yes", "no"]}

df = pd.DataFrame(raw_data)

In [5]:
df

     이름  타입  체력 도감등록
0  이상해씨   풀  45  yes
1   파이리   불  39   no
2   꼬부기   물  44  yes
3   캐터피  벌레  45   no

In [6]:
df.iloc[::2]

     이름 타입  체력 도감등록
0  이상해씨  풀  45  yes
2   꼬부기  물  44  yes

In [7]:
df.loc[::2]

     이름 타입  체력 도감등록
0  이상해씨  풀  45  yes
2   꼬부기  물  44  yes

In [8]:
df.iloc[0:3:2]

     이름 타입  체력 도감등록
0  이상해씨  풀  45  yes
2   꼬부기  물  44  yes

In [10]:
df.iloc[::-1]

     이름  타입  체력 도감등록
3   캐터피  벌레  45   no
2   꼬부기   물  44  yes
1   파이리   불  39   no
0  이상해씨   풀  45  yes

# 원소 선택
- 데이터프레임의 행 인덱스와 열 이름을 [행, 열] 형식의 2차원 좌표로 입력하여 원소를 지정
- 원소가 위치하는 행과 열의 좌표를 입력하면 해당 위치의 원소가 변환
- 1개의 행과 2개 이상의 열 또는 2개 이상의 행과 1개의 열을 선택하면 시리즈가 변환
- 2개 이상의 행과 2개 이상의 열을 선택하면 데이터프레임 객체를 반환

In [11]:
df

     이름  타입  체력 도감등록
0  이상해씨   풀  45  yes
1   파이리   불  39   no
2   꼬부기   물  44  yes
3   캐터피  벌레  45   no

In [12]:
# set_index() : 특정 컬럼을 새로운 인덱스로 지정
df2 = df.set_index("이름")

In [13]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  45  yes
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [15]:
# 이상해씨의 체력
df2.loc["이상해씨", "체력"]

45

In [16]:
df.iloc[0,1]

'풀'

In [17]:
# 이상해씨의 타입, 체력
df2.loc["이상해씨",["타입", "체력"]]

타입     풀
체력    45
Name: 이상해씨, dtype: object

In [18]:
df.iloc[0,[0,1]]

이름    이상해씨
타입       풀
Name: 0, dtype: object

In [19]:
df2.loc["이상해씨", "타입" : "체력"]

타입     풀
체력    45
Name: 이상해씨, dtype: object

In [20]:
df2.iloc[0, 0:2]

타입     풀
체력    45
Name: 이상해씨, dtype: object

In [21]:
# 이상해씨, 파이리의 타입, 체력
df2.loc[["이상해씨", "파이리"], ["타입", "체력"]]

     타입  체력
이름
이상해씨  풀  45
파이리   불  39

In [24]:
df2.iloc[[0,1],[0,1]]

     타입  체력
이름
이상해씨  풀  45
파이리   불  39

In [25]:
df2.loc["이상해씨" : "파이리", "타입" : "체력"]

     타입  체력
이름
이상해씨  풀  45
파이리   불  39

In [26]:
df2.iloc[:2, :2]

     타입  체력
이름
이상해씨  풀  45
파이리   불  39

# 열 추가

- df["추가하려는 열 이름"] = 데이터값 또는 배열
    - 단일 값을 입력하면 모든 행에 동일한 값이 입력됨

In [27]:
df3 = df.copy()
df3

     이름  타입  체력 도감등록
0  이상해씨   풀  45  yes
1   파이리   불  39   no
2   꼬부기   물  44  yes
3   캐터피  벌레  45   no

In [28]:
# 서식지 추가
df3["서식지"] = "공원"

In [29]:
df3

     이름  타입  체력 도감등록 서식지
0  이상해씨   풀  45  yes  공원
1   파이리   불  39   no  공원
2   꼬부기   물  44  yes  공원
3   캐터피  벌레  45   no  공원

In [30]:
df4 = df.copy()

In [31]:
df4["서식지"] = ["공원", "도로", "호수", "숲"]

In [32]:
df4

     이름  타입  체력 도감등록 서식지
0  이상해씨   풀  45  yes  공원
1   파이리   불  39   no  도로
2   꼬부기   물  44  yes  호수
3   캐터피  벌레  45   no   숲

# 행 추가

- 추가하려는 행 이름과 데이터 값을 loc을 이용하여 입력\

In [33]:
df5 = df.copy()
df

     이름  타입  체력 도감등록
0  이상해씨   풀  45  yes
1   파이리   불  39   no
2   꼬부기   물  44  yes
3   캐터피  벌레  45   no

In [34]:
df5.loc[4] = 0

In [35]:
df5

     이름  타입  체력 도감등록
0  이상해씨   풀  45  yes
1   파이리   불  39   no
2   꼬부기   물  44  yes
3   캐터피  벌레  45   no
4     0   0   0    0

In [37]:
df5.loc[5] = ["뿔충이", "벌레", 32, "yes"]

In [38]:
df5

     이름  타입  체력 도감등록
0  이상해씨   풀  45  yes
1   파이리   불  39   no
2   꼬부기   물  44  yes
3   캐터피  벌레  45   no
4     0   0   0    0
5   뿔충이  벌레  32  yes

In [41]:
# 기존 행 복사해서 새로운 행 추가
df5.loc["행6"] = df5.loc[4]

In [42]:
df5

      이름  타입  체력 도감등록
0   이상해씨   풀  45  yes
1    파이리   불  39   no
2    꼬부기   물  44  yes
3    캐터피  벌레  45   no
4      0   0   0    0
5    뿔충이  벌레  32  yes
행6     0   0   0    0

# 원소 값 변경

- 데이터프레임의 특정 원소를 선택하고 새로운 데이터 값으 지정
- 원소 1개를 선택하거나 여러 원소를 선택하여 한꺼번에 값을 바꿀 수도 있음

In [43]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  45  yes
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [44]:
# 이상해씨의 체력 수정
df2.iloc[0, 1] = 51

In [45]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  51  yes
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [46]:
df2.loc["이상해씨", "체력"] = 19

In [47]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  19  yes
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [50]:
# 이상해씨의 체력, 도감등록 수정
df2.loc["이상해씨", ["체력", "도감등록"]] = (84, "no")

In [51]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  84   no
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

# 행, 열의 위치 바꾸기(전치)
- 데이터프레임의 행과 열을 서로 맞바꾸는 방법
    - 열 이름이 행 인덱스로 이동하고 행 인덱스가 열 이름으로 이동

- 전치의 결과로 새로운 객체를 변환
    - 기존의 객체를 변경하고 싶다면 객체의 새로운 객체를 재할당 해주는 과정이 필요

In [52]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  84   no
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [53]:
# df를 전치(메서드 활용)
df2.transpose()

이름   이상해씨 파이리  꼬부기 캐터피
타입      풀   불    물  벌레
체력     84  39   44  45
도감등록   no  no  yes  no

In [54]:
df2

      타입  체력 도감등록
이름
이상해씨   풀  84   no
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [57]:
# df를 전치(클래스 속성 활용)
df2.T

이름   이상해씨 파이리  꼬부기 캐터피
타입      풀   불    물  벌레
체력     84  39   44  45
도감등록   no  no  yes  no

In [59]:
df2 = df2.transpose()
df2

      타입  체력 도감등록
이름
이상해씨   풀  84   no
파이리    불  39   no
꼬부기    물  44  yes
캐터피   벌레  45   no

In [60]:
df2.T

이름   이상해씨 파이리  꼬부기 캐터피
타입      풀   불    물  벌레
체력     84  39   44  45
도감등록   no  no  yes  no